In [1]:
import numpy as np
import pandas as pd

In [22]:
df = pd.read_csv('exemplo', sep=',')

In [23]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df2 = pd.read_csv('exemplo.csv', sep=',')

In [9]:
df2

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [24]:
df = df + 1

In [25]:
df

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [26]:
df.to_csv('exemplo2.csv', sep=';', decimal=',')

In [27]:
df = pd.read_csv('exemplo2.csv', sep=';')

In [28]:
df

   Unnamed: 0   a   b   c   d
0           0   1   2   3   4
1           1   5   6   7   8
2           2   9  10  11  12
3           3  13  14  15  16